{
    "﻿Brice Jacobs Clearance: Secret\nBooz Allen Hamilton, Inc Residence: Oxon Hill, MD\nEmail: Jacobs_Brice@bah.com Willing to relocate: Yes\nCell: (302) 423-5934 Level: Sr Consultant\nLast update: 08/08/2019\n% Willing to Travel: 100%\nEXPERIENCE SUMMARY\nDevOps Engineer with analytical and software experience of investigating, diagnosing system problem and knowledge of software. Managing multiple tasks and achieve results while displaying a strong work ethics. Looking for a career advancement opportunity with a company that will challenge my problem-solving skills and allow me to develop my knowledge and potential.\nCOMPETENCIES\nLinux/Windows Systems Administrator\nDevOps Engineer\nSystems/Software Engineering\nIntegration Engineer\nSystems Analyst\nJira Administrator\nWindows/Linux Systems Administrator (8 years)\nSystems Engineer (8 years)\nContinuous Integration Systems (3 years)\nDatabase Engineer (3 years)\nSoftware Testing and Validation (6 years)\nData Analyst (5 years)\nFront-end/Back-end Tester(4 years)\nSystems Integration(5 years)\nScrum Master (1 year)\nAutomation (3 years)\nSoftware Engineering (2 years)\nDeploy/configure Linux/Windows Servers (8 years)\nSystem/Network Management (5 years)\nEDUCATION\nBS Information Technology, Delaware State University, 2013\nCERTIFICATIONS\nCertificates: Security+ (2018)\nSUMMARY OF SKILLS, TOOLS, AND TECHNOLOGIES:\nProgramming Languages: Java (4 yrs), Java Script (3 yrs). Python (4yrs), SharePoint (1 yr), SQL (3yrs), Bash Scripting (6 yrs)\nFrameworks: Data-Driven\nSoftware/COTS: Tomcat/Apache (5 yrs), Java (5 yrs), Nagios (4 yrs), Puppet (2 yrs), Splunk (2 yrs), GIT (3 yrs), JIRA/Confluence (3 yrs, User), Ansible (2 yrs), Nginx (2 yrs), ELK Stack (2 yrs), Active Directory (4 yrs)\nOperating Systems: Linux/Unix (6 yrs), Windows (6 yrs), Ubuntu (6 yrs)\nEXPERIENCE DETAILS\nBooz Allen Hamilton Inc., Sr. Consultant 7/2016 – Present\nMcLean, VA\n    • DIBNet – Washington DC\n    • Assisting testers develop persistent automated scripts\n    • Configuring E2E testing for Angular projects, using Jest-Playwright and Codeceptjs\n    • Implementing scripts in Jenkins-CI\n    • Assisting, colleagues resolve any configuration issues they come across\n    • Assisting the testers automate test scripts\n    • Experience in designing/developing Angular/Node JS applications\n    • Generate design and development plan using new applicable technology and current tools and techniques to provide expert code for to accomplish highly complex business and technology needs\n    • Provide descriptive technical visual program specifications for use in development process Participate in coding, testing, through implementation within an agile environment, ensuring all designs are maintainable, and in accordance with technology architecture, hardware, cross environments, and aid to achieve the future technological vision\n    • DevOps Automation Test Engineer – Developer, 02/2021 to 09/2021\n    • Defense Collaborative Services-SAFE – Washington\n    • Involved in preparing test strategies for client-side verification and validations.\n    • Involved in the design and implementation of the Selenium Web Driver automation framework for smoke and regression test suites (TestNG and Ant).\n    • Configured Selenium Web Driver, TestNG, Maven tool and created selenium automation scripts in java using TestNG prior to agile release.\n    • Involved in automating test cases using Selenium Web Driver with TestNG.\n    • Tested applications developed in Java with the TestNG framework.\n    • Defined, built and maintained the test environment and tools, together with Software and other Test Engineers/Integrator.\n    • Developed an Automation framework using Selenium Web Driver.\n    • Setup Jenkins CI/CD\n    • Systems Engineer (Linux/Windows) - January 01/2019-02/2021\n    • NCR IADS\n    • Supports the operation and maintenance of ERSA and facilitate NCR IADS stakeholder community communications for the Joint Air Defense Operating Center (JADOC) at Joint Base Anacostia Boiling (JBAB) as a Linux Systems Engineer\n    • Attend and participate in NCR IADS related meetings, reviews, and working groups including: Morning snapshots, PMO, CCB/TRB, and weekly engineering meetings\n    • Conduct troubleshooting and functional testing\n    • Install, configure, and maintain Microsoft client/server and Red Hat Enterprise Linux operation systems (OS)\nInstall and maintain the ERSA Active Directory Domain Services (AD DS)\nInstall, configure, maintain, and monitor the Network Attached Storage (NAS) servers and Storage Area Networks (SAN)\n    • Configured the NAS servers to conduct daily backups of the entire ERSA and AFJS systems\n    • Create repositories, shared drives, and storage to assist the client’s everyday needs\n    • Deploy Windows and Linux servers for testing before making any changes to the system\n    • Integrate Red Hat Enterprise Linux 6 with Active Directory\n    • Use SolarWinds monitoring tool to provide support and maintain the ERSA and AFJS systems\n    • Maintaining and updating Linux offline environments with the latest patches\n    • Monitor mission’s system testing, including ERSA 5.0 testing\n    • Provide daily support and updates on all Sensornodes and cameras for ERSA and AFJS\n    • Maintain and ERSA Domain Name Server (DNS)\n    • Apply STIG and cyber security directives\n    • Proactively provide clients with SOP documents and any other supporting documents\n    • Document new findings, develop a solution to resolve the issue by mitigating a plan before the issue gets severe\n    • Deploy and configure new equipment for testing\n    • On a rotating on-call ERSA 24/7 maintenance schedule to provide support if needed afterhours\n    • Supported DRCED UOT as a Jira Administrator as well assisting with Qlik Sense\n    • Created required fields in JIRA for clients and their ticketing system\n    • Imported data from Jira into Qlik Sense with API calls to create dashboards for clients\n    • Supported the Secure Configuration Management (SCM) Development and Operations as a Test Engineer\n    • Tested quality assurance, including functional, integration, regression, and user acceptance testing\n    • Excellent technical expertise and comprehension of information technology, network, systems, and software architecture\n    • Wrote test plan documentations to test the Operational Attribute Manager and Asset Publishing Service extensions, using ePolicy Orchestrator.\n    • Assisted the Engineering and Solution Analysis (ESA) Support project with analyzing logs using ELK Stack to pull logs from the F5 Big-IP and Nagios servers to analyze statistical data.\n    • Systems Analyst for SAF/FM ITLML at JBA(Joint Base Andrews)\n    • Employed disciplined processes in accomplishing contract tasking, using commercial best practices IAW of AFI 63-1201, Life Cycle Systems Engineering, for planning, architecting, requirements development and management, design, technical management and control, technical reviews, technical measurements, integrated risk management, configuration management, data management, interface management, decision analysis, and test and evaluation, verification and validation\n    • Employed the principles of open technology development described in the DoD Open Technology Development Guidebook and in Net-Centric Enterprise Solutions for Interoperability (NESI) body of knowledge and systems engineering activities used in developing contractor solutions shall adhere to open architecture designs for hardware and software and employ a modular open systems architecture approach.\n    • Created and submitted an automated telework document in PDF for SAF/FM ITLML\n    • Created Standard Operation Procedure (SOP) documents\n    • Created technical procedure documents to validate installation and configuration\n    • Assisted to resolve pending issues and customers request for Serena Business Manager (SBM) Dimensions\n    • Assisted the Oracle Database Admin for FMDQS with SQL/Configuration scripts\n    • Deployed Microsoft SharePoint and Project Server 2013 in AFNIC for EPL certification and validation\n    • Created test environments on local machine to validate installations/configurations before deploying in production\n    • Provide quality advisory and assistance services and customer support\n    • Meet customer’s agreed-upon timelines for scheduled delivery of services\n    • Provide timely and accurate reports and respond to the customer’s requests for quotes and configuration assistance as identified in each task order\n    • Assist with creating analytical charts and graphs to assist with FMDQS as well as PfM (Portfolio Management)\n    • Assisted with reviewing and editing documents before submitting to clients and management on a daily basis\n    • Assisted the PM to ensure we meet deadlines and assist with any additional tasks while management is away\nSupported the Defense Collaboration Services (DCS) project starting November 2016\n    • Supported DCS infrastructure environment comprising of RHEL 6.8, 7.2+\n    • Installed new software, troubleshooting and resolving network and performance issues, managing configurations, and automating integration and deployment processes\n    • Provided secure web conferencing and instant messaging services on the Non-secure Internet Protocol Router Network (NIPRNet) and Secure Internet Protocol Routing Network (SIPRNet)\n    • Developed methods and processes for supporting software deliveries, compilation and maintenance\n    • Executed system and subsystem level software installation and configuration\n    • Provided CM support for weekly deliverables\n    • Updated and tested Ansible playbooks on a weekly basis\n    • Tested screen share and mobile chat, providing feedback on the deployed software\n    • Recommended changes that will make the DCS perform better and more user friendly\n    • Provided weekly reports for accomplished task, current tasks, and any other task that occurred on the DCS\n    • Supported the DISA Enterprise Computing Center (DECC) by providing updated Ansible playbooks and support\n    • Created Ansbile Automation instructions for first time users\n    • Created Ansible setup instruction for clients to integrate and set up the DCS lab environment\n    • Supported the Software-Defined Network (SDN) by providing a video on hacking and intrusion alerts via Splunk\n    • Configured Openstack to work in the SDN lab to run on RHEL 7\n    • Created Splunk dashboards, searches and visualizations for SDN and DCS project\n    • Integrated Splunk in the DCS lab to index logs and monitor services\n    • Installed apps and add-ons to Splunk to test different use cases for network traffic and metrics\n    • Integrated ValarieDB in the DCS lab to test against weekly RFCs provided by DISA\n    • Created PowerPoints to present to clients on deliveries and recommendations for software\n    • Attended weekly IAVA, RFC, and Cybersecurity meetings at DISA\n    • Attended weekly status calls about what tasks are at hand\n    • Monitored and administrating of Red Hat Linux on Enterprise class servers for operating systems, patches, packages, hardware, firmware drivers\n    • Utilized Wireshark and Snort to track and trace intrusion alert\n    • Created technical documents and updated them on a weekly basis in Confluence\nPartnered with Solers Inc. since September 2016, working on the Dibnet project.\n    • Used automated deployment and continuous integration tools such as ansible.\n    • Used source code management tools, including Maven and GIT\n    • Worked with Atlassian products, such as Jira and Confluence\n    • Worked with Juno Gerrit, code review tools\nAdvance Acoustics Concepts, Integration Engineer 5/2016 – 7/2016\nManassas, VA.\n    • Partnered with Lockheed Martin, working with the Department of Navy, sonar system\n    • Supported software developers with a variety of moderately complex engineering duties and/or hands-on tasks\n    • Developed methods and processes for supporting software deliveries, compilation and maintenance  \n    • Supported the execution system level software test events\n    • Executed system and subsystem level software installation and configuration\n    • Designed and implemented software to support integration and testing methods\n    • Developed and supported documentation to maintain lab processes\n    • Launched and installed CEI (OS/COTS) on primary and secondary servers\n    • Configured and launched lab system software install using the export commands and install script\n    • Duplicated primary servers to a secondary(backup) server in case the primary fail over\nLeidos Inc., Linux/Windows Systems Administrator 1/ 2014 – 4/2016\nVienna, VA\n    • Monitored and administrating of Red Hat Linux on Enterprise class servers for operating systems, patches, packages, hardware, firmware drivers. \n    • Expertise in Building and supporting environments consisting Testing, Contingency, Production and Disaster Recovery servers.\n    • Supported infrastructure environment comprising of RHEL 6.5, 6.6\n    • Performed patching of RHEL using yum and rpm\n    • Installed, Configured, and distributed newly acquired equipment. \n    • Served as the technical expert responsible for the engineering, implementation, installation, operation, and maintenance within Linux Red Hat and Centos networks.\n    • Responsible for setting up administrator and service accounts, maintaining system documentation, tuning system performance, installing system wide software, validating and implementing critical system patches, and allocating mass storage space.\n    • Handled networking support, administration, overall strategy, design, implementation, and operational aspects of multiple systems, operating environments, and related software.\n    • Scheduled, planned, and overseen system upgrades.\n    • Developed functional requirements through interaction with end-users and coordinates with development team on systematic enhancements or changes.\n    • Performed fault isolation and diagnostic/assessment functions to include determination and execution of corrective action(s) on real-time basis.\n    • Assisted in planning for upgrades and replacements for the program assets reaching the end of their life cycle. \n    • Supported asset acquisition, installation, configuration, and maintenance. \n    • Performed administrative level installation, configuration, and maintenance on all components/assets associated with the program. \n    • Supported senior staffs as required and ensures customer requirements and project milestones are met.\n    • Interfaces with functional users in both routine and reactive monitoring situations.  Interaction normally requires the ability to gain cooperation of others. \n    • Also required are communication and presentation skills and the ability to operate independently. \n    • Implementation of SSH for secure transfers and implementation of PKI between servers to enable password less logins between Servers. \n    • Supported or domains hosting and domain registration and creation. \n    • Changed permissions of file systems, Directories, and changed the permissions of users by giving sudo access etc. \n    • Supported the Linux operating systems and completed install at client’s place.\n    • Installed Software, troubleshot, diagnosed, and resolved software and connectivity problems in accordance with Service levels. \n    • Worked with Puppet for a year and a half to ensure consistency, reliability, and stability.\n    • Used VMWARE to create snapshots, clones, and backups up servers before maintenance.\n    • Experienced with virtualization technologies like installing, configuring, VMware vSphere.\n    • Creation, management, administration and maintenance of virtual servers and clients.\n    • Installed and configured the Nagios monitoring tool to manage all servers, Windows and Linux base across the network.\n    • Managed the servers by using customized script to report to the Nagios server.\n    • Created scripts to automate software installation and system configurations as well.\n    • Backed up servers and processes on Linux/Windows servers using VMware and various command lines for the directories.\n    • Worked closely with peers to coordinate maintenance and ensure quality work was provided to complete the task at a timely manner.\n    • Coordinated with the infrastructure team to provide clones and backups of the servers before and after maintenance.\n    • Configured and installed software such as Apache and Java on Windows and Linux servers.\n    • Performed smoke test using AHLTA to ensure there are no severity ones.\n    • Performed component test and functional test for new customer’s log in page and password screen.\n    • Performed web usability testing for ease of learning, navigation, web accessibility, general \nappearance for the user satisfaction by keeping the user’s need.\n    • Performed web security testing by checking the login credentials (access ID, password), device used and geographic location to identify the authentic user/customer.": null
}